charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
/* aos_usb: who owns the USB port. See include/aos_usb.h and docs/USB.md.
 *
 * Phase 1 of the USB work: the switch, and the two smallest things each side
 * can do so the switch can be tested from the portal.
 *
 *   CONSOLE  the PHY on the USB-Serial-JTAG, as at boot. Nothing installed.
 *   DEVICE   TinyUSB with one CDC-ACM interface; stdout goes to it unless
 *            aos_usb_console_on_cdc(false) was called. The Mac sees an
 *            "AmoledOS" serial port.
 *   HOST     the USB Host Library with one client that opens every device
 *            that enumerates, writes its descriptors to the log and keeps a
 *            short table of them for /api/usb.
 *
 * The mux: usb_new_phy() (inside both installs) points the internal PHY at
 * the OTG controller. usb_del_phy() (inside both uninstalls) does NOT point it
 * back — it only clears the pull-up overrides — so after leaving an OTG mode
 * this file flips RTC_CNTL.usb_conf.sw_usb_phy_sel back itself, with the two
 * LL calls the Serial-JTAG driver uses at boot. Whether the Mac re-enumerates
 * the Serial-JTAG after that without a reset is test T2 of docs/USB.md.
 *
 * Every switch logs the internal / executable heap before and after, which is
 * test T3: the cost of each stack, in the log and in /api/usb ("mem"). */
#include "sdkconfig.h"
#include <string.h>
#include <stdio.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_log.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_pm.h"
#include "esp_intr_alloc.h"
#include "esp_rom_sys.h"
#include "esp_attr.h"
#include "esp_rom_uart.h"
#include "soc/usb_dwc_struct.h"
#include "soc/usb_wrap_struct.h"
#include "soc/rtc_cntl_struct.h"
#include "hal/usb_serial_jtag_ll.h"
#include "usb/usb_host.h"
#include "usb/usb_helpers.h"
#include "usb/msc_host.h"
#include "usb/msc_host_vfs.h"
#include "esp_vfs_fat.h"
#include "tinyusb_msc.h"
#include "tusb.h"
#include "class/hid/hid_device.h"
#include "esp_mac.h"
#include "driver/sdmmc_host.h"
#include "sdmmc_cmd.h"
#include "bsp/esp32_s3_touch_amoled_1_8.h"   /* the SD pins and the mount point */
#include "aos_hal.h"
#include <errno.h>
#include <sys/stat.h>
#include "tinyusb.h"
#include "tinyusb_default_config.h"
#include "tinyusb_cdc_acm.h"
#include "vfs_tinyusb.h"
#include "esp_vfs_console.h"
#include <fcntl.h>
#include <unistd.h>
#include "aos_usb.h"

static const char *TAG = "aos_usb";

/* -------------------------------------------------------------------------- */
/* State                                                                       */
/* -------------------------------------------------------------------------- */

#define AOS_USB_MAX_DEV   4        /* what the inspector's table holds */
#define AOS_USB_MAX_ITF   6

typedef struct {
    bool     used;
    uint8_t  addr;
    uint8_t  speed;                 /* usb_speed_t */
    uint16_t vid, pid;
    uint8_t  dev_class, dev_subclass, dev_protocol;
    uint8_t  n_itf;
    uint8_t  itf_class[AOS_USB_MAX_ITF];
    uint8_t  itf_subclass[AOS_USB_MAX_ITF];
    uint8_t  itf_protocol[AOS_USB_MAX_ITF];
    char     manufacturer[32];
    char     product[32];
    char     serial[24];
    usb_device_handle_t hdl;        /* kept open until it goes, like the IDF example */
} aos_usb_dev_t;

static bool                 s_console_on_cdc = true;
static bool                 s_console_redirected;
static SemaphoreHandle_t    s_lock;             /* mode changes and the device table */
static esp_pm_lock_handle_t s_pm_lock;
static aos_usb_dev_t        s_devs[AOS_USB_MAX_DEV];
static int                  s_seen;             /* devices enumerated since host mode came up */

/* Host mode: two tasks, as in the IDF usb_host_lib example. */
static usb_host_client_handle_t s_client;
static SemaphoreHandle_t        s_task_done;    /* counting: each task gives once on exit */
static SemaphoreHandle_t        s_installed;    /* binary: the library task reports usb_host_install() */
static esp_err_t                s_install_err;
static volatile bool            s_client_quit;
static volatile uint8_t         s_pending_new[AOS_USB_MAX_DEV];
static volatile int             s_pending_new_n;
static usb_device_handle_t      s_pending_gone[AOS_USB_MAX_DEV];
static volatile int             s_pending_gone_n;

/* D2, disk mode: the card as a USB drive. The BSP's mount is undone, the
 * card is initialised again here and handed to esp_tinyusb's MSC storage,
 * which owns it from then on: on the USB side while the computer has it,
 * mounted back at /sdcard for the watch when the computer ejects it (that
 * is the driver's auto-mount, and the event callback tells the HAL). */
static sdmmc_card_t               *s_card;
static tinyusb_msc_storage_handle_t s_storage;
static bool                        s_card_away;

/* H1: one pendrive at a time, mounted at /usb. The MSC class driver runs
 * its own task; its callback only takes note, and the client task does the
 * install and the mount (control transfers from inside the callback would
 * wait on the task that is running the callback). */
#define AOS_USB_MSC_ROOT "/usb"
static bool                     s_msc_installed;
static msc_host_device_handle_t s_msc_dev;
static msc_host_vfs_handle_t    s_msc_vfs;
static bool                     s_msc_mounted;
static uint32_t                 s_msc_sectors, s_msc_sector_size;
static volatile uint8_t         s_msc_pending_addr;
static volatile bool            s_msc_pending_gone;

/* -------------------------------------------------------------------------- */
/* Boot, and TinyUSB's own log                                                 */
/* -------------------------------------------------------------------------- */

/* Breadcrumbs across a reset: the teardown of an OTG mode has crashed in
 * ways that leave no core dump and no console, so every step writes its
 * number to RTC memory, which survives everything but a power cycle, and
 * /api/usb reports the last one seen at boot ("boot_step"). */
#define STEP_MAGIC 0x55534253u
static RTC_NOINIT_ATTR uint32_t s_step_magic;
static RTC_NOINIT_ATTR uint32_t s_step;
static uint32_t s_boot_step;                /* what the previous life left, 0 if nothing */
#define STEP(n) do { s_step_magic = STEP_MAGIC; s_step = (n); } while (0)

#define ROM_RING 8192
static char             *s_rom_ring;        /* PSRAM; written from the TinyUSB task and its ISR */
static volatile uint32_t s_rom_w;

