charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
static aos_usb_mode_t       s_mode = AOS_USB_CONSOLE;

static void rom_putc(char c)
{
    if (s_mode == AOS_USB_CONSOLE) {
        esp_rom_output_putc(c);             /* the console keeps everything it used to get */
    }                                       /* in an OTG mode the Serial-JTAG is not there: no waiting on its FIFO */
    if (s_rom_ring) {
        s_rom_ring[s_rom_w % ROM_RING] = c;
        s_rom_w++;
    }
}

void aos_usb_init(void)
{
    s_boot_step = (s_step_magic == STEP_MAGIC) ? s_step : 0;
    STEP(0);
    /* Pad down for a moment, as in phy_back_to_console(): after a reboot
     * from an OTG mode the computer may still hold the OTG device's address
     * (a reset is too short a detach for some hosts), and then the
     * Serial-JTAG never enumerates until the cable is pulled. */
    usb_serial_jtag_ll_phy_enable_pad(false);
    usb_serial_jtag_ll_phy_enable_external(false);
    vTaskDelay(pdMS_TO_TICKS(100));
    usb_serial_jtag_ll_phy_enable_pad(true);
    /* TinyUSB logs through esp_rom_printf, from its ISR included. Level 1
     * (errors and asserts) only: at level 2 it prints on every transfer,
     * from the ISR, and disk mode died of the interrupt watchdog while the
     * Mac read the card (2026-09-12). */
    s_rom_ring = heap_caps_calloc(ROM_RING, 1, MALLOC_CAP_SPIRAM);
    esp_rom_install_channel_putc(1, rom_putc);
}

int aos_usb_tusb_log(char *out, size_t len)
{
    if (!s_rom_ring || len == 0) {
        if (len) out[0] = 0;
        return 0;
    }
    uint32_t w = s_rom_w;
    uint32_t have = w < ROM_RING ? w : ROM_RING;
    uint32_t start = w - have;
    size_t n = 0;
    for (uint32_t i = 0; i < have && n + 1 < len; i++) {
        out[n++] = s_rom_ring[(start + i) % ROM_RING];
    }
    out[n] = 0;
    return (int)n;
}

/* -------------------------------------------------------------------------- */
/* Helpers                                                                     */
/* -------------------------------------------------------------------------- */

static bool ensure_init(void)
{
    if (s_lock) {
        return true;
    }
    s_lock = xSemaphoreCreateMutex();
    s_task_done = xSemaphoreCreateCounting(2, 0);
    s_installed = xSemaphoreCreateBinary();
    if (!s_lock || !s_task_done || !s_installed) {
        ESP_LOGE(TAG, "no memory for the locks");
        return false;
    }
    if (esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0, "aos_usb", &s_pm_lock) != ESP_OK) {
        s_pm_lock = NULL;       /* no PM: fine, there is no light sleep to hold off */
    }
    return true;
}

static void mem_line(const char *when)
{
    ESP_LOGI(TAG, "mem %s: internal %u free, exec %u free, largest exec block %u",
             when,
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_EXEC),
             (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_EXEC));
}

/* usb_del_phy() leaves the mux on the OTG side; the two LL calls are what
 * the Serial-JTAG driver does at boot (usb_serial_jtag.c, driver install).
 *
 * The pad goes down first, for a moment: measured on the board (2026-09-12,
 * test T2), flipping the mux with the pad enabled keeps D+ high through the
 * change, the Mac never sees a detach, and it goes on talking to the address
 * of the device that is no longer there ("AmoledOS watch" stays in ioreg and
 * the Serial-JTAG never comes back until the cable is pulled). A few ms with
 * the pull-up gone is a detach; enabling the pad again is a fresh attach. */
static void phy_back_to_console(void)
{
    usb_serial_jtag_ll_phy_enable_pad(false);
    usb_serial_jtag_ll_phy_enable_external(false);
    vTaskDelay(pdMS_TO_TICKS(100));
    usb_serial_jtag_ll_phy_enable_pad(true);
}

static void str_copy(char *out, size_t len, const usb_str_desc_t *d)
{
    out[0] = 0;
    if (!d || d->bLength < 2) {
        return;
    }
    int n = (d->bLength - 2) / 2;
    size_t o = 0;
    for (int i = 0; i < n && o + 1 < len; i++) {
        uint16_t c = d->wData[i];
        out[o++] = (c >= 32 && c < 127) ? (char)c : '?';
    }
    out[o] = 0;
}

static const char *class_name(uint8_t c)
{
    switch (c) {
    case USB_CLASS_PER_INTERFACE: return "per-interface";
    case USB_CLASS_AUDIO:         return "audio";
    case USB_CLASS_COMM:          return "cdc";
    case USB_CLASS_HID:           return "hid";
    case USB_CLASS_PRINTER:       return "printer";
    case USB_CLASS_MASS_STORAGE:  return "msc";
    case USB_CLASS_HUB:           return "hub";
    case USB_CLASS_CDC_DATA:      return "cdc-data";
    case USB_CLASS_VIDEO:         return "video";
    case USB_CLASS_WIRELESS_CONTROLLER: return "wireless";
    case USB_CLASS_MISC:          return "misc";
    case USB_CLASS_APP_SPEC:      return "app-specific";
    case 0xff:                    return "vendor";
    default:                      return "other";
    }
}

/* -------------------------------------------------------------------------- */
/* Device mode: TinyUSB, one CDC port                                          */
/* -------------------------------------------------------------------------- */

/* The console on the CDC port, by hand.
 *
 * esp_tinyusb ships tinyusb_console_init()/deinit() for this, and its deinit
 * restores the streams by reopening "/dev/uart/<CONFIG_ESP_CONSOLE_UART_NUM>".
 * This firmware's console is the USB-Serial-JTAG, so that number is -1, the
 * freopen() fails, the function assigns the NULL it got to stdout, and the
 * next log line from any task is a PANIC (measured on the board, 2026-09-12,
 * test T2). The real console is "/dev/console" whatever it sits on.
 *
 * freopen() reworks the FILE object in place, and every task's stdout points
 * at the same object, so one call moves everybody. On failure newlib leaves
 * the stream unusable, which is why each path is tried with open() first. */
static bool stream_to(const char *path)
{
    int fd = open(path, O_RDWR);
    if (fd < 0) {
        ESP_LOGW(TAG, "%s does not open, the console stays where it is", path);
        return false;
    }
    close(fd);
    FILE *o = freopen(path, "w", stdout);
    FILE *e = freopen(path, "w", stderr);
    FILE *i = freopen(path, "r", stdin);
    return o && e && i;
}

/* Device mode gets its own configuration: CDC + HID (a keyboard and a
 * consumer-control device, D3). esp_tinyusb's default descriptor lists
 * every class that is compiled in, MSC included, and with no MSC driver
 * installed the class callbacks dereference a NULL driver (tinyusb_msc.c,
 * _msc_storage_get_by_lun) the moment the computer asks TEST UNIT READY: a
 * panic seconds after enumeration, measured 2026-09-12. And it has no
 * default for HID at all. Disk mode installs the MSC driver and keeps the
 * default CDC+MSC descriptor. */
enum { AOS_ITF_CDC = 0, AOS_ITF_CDC_DATA, AOS_ITF_HID, AOS_ITF_DEVICE_TOTAL };
#define AOS_EP_CDC_NOTIF   0x81
#define AOS_EP_CDC_OUT     0x02
#define AOS_EP_CDC_IN      0x82
#define AOS_EP_HID_IN      0x83
enum { AOS_STR_LANG = 0, AOS_STR_MANUFACTURER, AOS_STR_PRODUCT, AOS_STR_SERIAL, AOS_STR_CDC, AOS_STR_HID, AOS_STR_COUNT };
enum { AOS_HID_REPORT_KEYBOARD = 1, AOS_HID_REPORT_CONSUMER = 2 };

static const uint8_t s_hid_report_desc[] = {
    TUD_HID_REPORT_DESC_KEYBOARD(HID_REPORT_ID(AOS_HID_REPORT_KEYBOARD)),
    TUD_HID_REPORT_DESC_CONSUMER(HID_REPORT_ID(AOS_HID_REPORT_CONSUMER)),
};
static const uint8_t s_cfg_device[] = {
    TUD_CONFIG_DESCRIPTOR(1, AOS_ITF_DEVICE_TOTAL, 0, TUD_CONFIG_DESC_LEN + TUD_CDC_DESC_LEN + TUD_HID_DESC_LEN,
                          TUSB_DESC_CONFIG_ATT_REMOTE_WAKEUP, 100),
    TUD_CDC_DESCRIPTOR(AOS_ITF_CDC, AOS_STR_CDC, AOS_EP_CDC_NOTIF, 8, AOS_EP_CDC_OUT, AOS_EP_CDC_IN, 64),
    TUD_HID_DESCRIPTOR(AOS_ITF_HID, AOS_STR_HID, HID_ITF_PROTOCOL_NONE, sizeof(s_hid_report_desc),
                       AOS_EP_HID_IN, 16, 10),
};
static const tusb_desc_device_t s_dev_device = {
    .bLength = sizeof(tusb_desc_device_t),
    .bDescriptorType = TUSB_DESC_DEVICE,
    .bcdUSB = 0x0200,
    .bDeviceClass = TUSB_CLASS_MISC,
    .bDeviceSubClass = MISC_SUBCLASS_COMMON,
    .bDeviceProtocol = MISC_PROTOCOL_IAD,
    .bMaxPacketSize0 = CFG_TUD_ENDPOINT0_SIZE,
    .idVendor = 0x303A,                     /* Espressif */
    .idProduct = 0x4005,                    /* esp_tinyusb's PID map: CDC | HID; 0x4003 is CDC+MSC (disk mode) */
    .bcdDevice = CONFIG_TINYUSB_DESC_BCD_DEVICE,
    .iManufacturer = AOS_STR_MANUFACTURER, .iProduct = AOS_STR_PRODUCT, .iSerialNumber = AOS_STR_SERIAL,
    .bNumConfigurations = 1,
};
