charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
static char s_serial[13];                   /* the chip's MAC, so two watches are two devices */
static const char *s_strings[AOS_STR_COUNT] = {
    (const char[]) { 0x09, 0x04 },          /* English (US) */
    "AmoledOS",
    "AmoledOS watch",
    s_serial,
    "AmoledOS console",
    "AmoledOS keys",
};

/* TinyUSB's HID class asks for these. */
uint8_t const *tud_hid_descriptor_report_cb(uint8_t instance)
{
    return s_hid_report_desc;
}

uint16_t tud_hid_get_report_cb(uint8_t instance, uint8_t report_id, hid_report_type_t report_type,
                               uint8_t *buffer, uint16_t reqlen)
{
    return 0;
}

void tud_hid_set_report_cb(uint8_t instance, uint8_t report_id, hid_report_type_t report_type,
                           uint8_t const *buffer, uint16_t bufsize)
{
    /* Keyboard LEDs (caps lock and friends): nothing to light. */
}

bool aos_usb_hid_ready(void)
{
    return s_mode == AOS_USB_DEVICE && tud_mounted() && tud_hid_ready();
}

static bool hid_wait_ready(void)
{
    for (int i = 0; i < 20 && !tud_hid_ready(); i++) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    return tud_hid_ready();
}

bool aos_usb_hid_key(uint8_t modifier, uint8_t keycode, int hold_ms)
{
    if (!aos_usb_hid_ready() || !hid_wait_ready()) {
        return false;
    }
    uint8_t keys[6] = { keycode, 0, 0, 0, 0, 0 };
    if (!tud_hid_keyboard_report(AOS_HID_REPORT_KEYBOARD, modifier, keys)) {
        return false;
    }
    vTaskDelay(pdMS_TO_TICKS(hold_ms > 0 ? hold_ms : 20));
    hid_wait_ready();
    tud_hid_keyboard_report(AOS_HID_REPORT_KEYBOARD, 0, NULL);
    vTaskDelay(pdMS_TO_TICKS(10));
    return true;
}

bool aos_usb_hid_consumer(uint16_t usage, int hold_ms)
{
    if (!aos_usb_hid_ready() || !hid_wait_ready()) {
        return false;
    }
    if (!tud_hid_report(AOS_HID_REPORT_CONSUMER, &usage, sizeof(usage))) {
        return false;
    }
    vTaskDelay(pdMS_TO_TICKS(hold_ms > 0 ? hold_ms : 20));
    hid_wait_ready();
    uint16_t none = 0;
    tud_hid_report(AOS_HID_REPORT_CONSUMER, &none, sizeof(none));
    vTaskDelay(pdMS_TO_TICKS(10));
    return true;
}

/* Names the apps and the portal use. "cmd+", "ctrl+", "alt+", "shift+"
 * prefixes stack on a key: "cmd+tab", "ctrl+shift+t". */
typedef struct { const char *name; uint16_t code; bool consumer; } aos_hid_name_t;
static const aos_hid_name_t s_hid_names[] = {
    { "play",    HID_USAGE_CONSUMER_PLAY_PAUSE,        true },
    { "pause",   HID_USAGE_CONSUMER_PLAY_PAUSE,        true },
    { "next",    HID_USAGE_CONSUMER_SCAN_NEXT_TRACK,         true },
    { "prev",    HID_USAGE_CONSUMER_SCAN_PREVIOUS_TRACK,     true },
    { "stop",    HID_USAGE_CONSUMER_STOP,              true },
    { "mute",    HID_USAGE_CONSUMER_MUTE,              true },
    { "volup",   HID_USAGE_CONSUMER_VOLUME_INCREMENT,  true },
    { "voldown", HID_USAGE_CONSUMER_VOLUME_DECREMENT,  true },
    { "brightup",   HID_USAGE_CONSUMER_BRIGHTNESS_INCREMENT, true },
    { "brightdown", HID_USAGE_CONSUMER_BRIGHTNESS_DECREMENT, true },
    { "pgup",    HID_KEY_PAGE_UP,     false },
    { "pgdn",    HID_KEY_PAGE_DOWN,   false },
    { "up",      HID_KEY_ARROW_UP,    false },
    { "down",    HID_KEY_ARROW_DOWN,  false },
    { "left",    HID_KEY_ARROW_LEFT,  false },
    { "right",   HID_KEY_ARROW_RIGHT, false },
    { "enter",   HID_KEY_ENTER,       false },
    { "esc",     HID_KEY_ESCAPE,      false },
    { "space",   HID_KEY_SPACE,       false },
    { "tab",     HID_KEY_TAB,         false },
    { "home",    HID_KEY_HOME,        false },
    { "end",     HID_KEY_END,         false },
    { "b",       HID_KEY_B,           false },     /* blank screen, Keynote and PowerPoint */
    { "f5",      HID_KEY_F5,          false },
    { "delete",  HID_KEY_BACKSPACE,   false },
};

bool aos_usb_hid_named(const char *name)
{
    uint8_t mod = 0;
    for (;;) {
        if      (!strncmp(name, "cmd+",   4)) { mod |= KEYBOARD_MODIFIER_LEFTGUI;   name += 4; }
        else if (!strncmp(name, "ctrl+",  5)) { mod |= KEYBOARD_MODIFIER_LEFTCTRL;  name += 5; }
        else if (!strncmp(name, "alt+",   4)) { mod |= KEYBOARD_MODIFIER_LEFTALT;   name += 4; }
        else if (!strncmp(name, "shift+", 6)) { mod |= KEYBOARD_MODIFIER_LEFTSHIFT; name += 6; }
        else break;
    }
    for (size_t i = 0; i < sizeof(s_hid_names) / sizeof(s_hid_names[0]); i++) {
        if (!strcmp(name, s_hid_names[i].name)) {
            return s_hid_names[i].consumer ? aos_usb_hid_consumer(s_hid_names[i].code, 0)
                                           : aos_usb_hid_key(mod, (uint8_t)s_hid_names[i].code, 0);
        }
    }
    if (name[0] && !name[1]) {              /* a single character: type it */
        return aos_usb_hid_type(name) == 1;
    }
    return false;
}

int aos_usb_hid_type(const char *ascii)
{
    static const uint8_t table[128][2] = { HID_ASCII_TO_KEYCODE };
    int sent = 0;
    for (; *ascii; ascii++) {
        unsigned char c = (unsigned char)*ascii;
        if (c >= 128) continue;
        uint8_t mod = table[c][0] ? KEYBOARD_MODIFIER_LEFTSHIFT : 0;
        uint8_t key = table[c][1];
        if (!key) continue;
        if (!aos_usb_hid_key(mod, key, 0)) break;
        sent++;
    }
    return sent;
}

static bool s_device_with_msc;              /* set by disk_start() before device_start() */

static bool device_start(void)
{
    tinyusb_config_t cfg = TINYUSB_DEFAULT_CONFIG();
    if (!s_device_with_msc) {
        if (!s_serial[0]) {
            uint8_t mac[6] = { 0 };
            esp_read_mac(mac, ESP_MAC_WIFI_STA);
            snprintf(s_serial, sizeof(s_serial), "%02X%02X%02X%02X%02X%02X",
                     mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        }
        cfg.descriptor.device = &s_dev_device;
        cfg.descriptor.full_speed_config = s_cfg_device;
        cfg.descriptor.string = s_strings;
        cfg.descriptor.string_count = AOS_STR_COUNT;
    }
    esp_err_t e = tinyusb_driver_install(&cfg);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "tinyusb_driver_install: %s", esp_err_to_name(e));
        return false;
    }
    tinyusb_config_cdcacm_t acm = { .cdc_port = TINYUSB_CDC_ACM_0 };
    e = tinyusb_cdcacm_init(&acm);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "tinyusb_cdcacm_init: %s", esp_err_to_name(e));
        tinyusb_driver_uninstall();
        return false;
    }
    if (s_console_on_cdc) {
        /* Non-blocking VFS (vfs_tinyusb.c): with nobody reading the port the
         * output is dropped, never stalls the tasks that log. */
        s_console_redirected = esp_vfs_tusb_cdc_register(TINYUSB_CDC_ACM_0, NULL) == ESP_OK &&
                               stream_to(VFS_TUSB_PATH_DEFAULT);
    }
    ESP_LOGI(TAG, "device mode: CDC up, console %s",
             s_console_redirected ? "on the CDC port" : "stays on the Serial-JTAG (now silent)");
    return true;
}

static void device_stop(void)
{
    STEP(20);
    if (s_console_redirected) {
        stream_to(ESP_VFS_DEV_CONSOLE);
        STEP(21);
        esp_vfs_tusb_cdc_unregister(NULL);
        s_console_redirected = false;
    }
    STEP(22);
    tinyusb_cdcacm_deinit(TINYUSB_CDC_ACM_0);
    STEP(23);
    esp_err_t e = tinyusb_driver_uninstall();
    STEP(24);
    if (e != ESP_OK) {
        ESP_LOGW(TAG, "tinyusb_driver_uninstall: %s", esp_err_to_name(e));
    }
}

