charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
bool aos_usb_msc_mounted(void)
{
    return s_msc_mounted;
}

const char *aos_usb_msc_root(void)
{
    return s_msc_mounted ? AOS_USB_MSC_ROOT : NULL;
}

long aos_usb_copy(const char *src, const char *dst)
{
    const size_t chunk = 32 * 1024;
    uint8_t *buf = heap_caps_malloc(chunk, MALLOC_CAP_SPIRAM);
    if (!buf) {
        errno = ENOMEM;
        return -1;
    }
    FILE *in = fopen(src, "rb");
    if (!in) {
        free(buf);
        return -1;
    }
    FILE *out = fopen(dst, "wb");
    if (!out) {
        int err = errno;
        fclose(in);
        free(buf);
        errno = err;
        return -1;
    }
    long total = 0;
    bool ok = true;
    size_t n;
    while ((n = fread(buf, 1, chunk, in)) > 0) {
        if (fwrite(buf, 1, n, out) != n) {
            ok = false;
            break;
        }
        total += (long)n;
    }
    if (ferror(in)) ok = false;
    fclose(in);
    if (fclose(out) != 0) ok = false;
    free(buf);
    if (!ok) {
        unlink(dst);
        return -1;
    }
    return total;
}

static void host_client_task(void *arg)
{
    usb_host_client_config_t cfg = {
        .is_synchronous = false,
        .max_num_event_msg = 5,
        .async = { .client_event_callback = client_event_cb, .callback_arg = NULL },
    };
    esp_err_t e = usb_host_client_register(&cfg, &s_client);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "usb_host_client_register: %s", esp_err_to_name(e));
        s_client = NULL;
        xSemaphoreGive(s_task_done);
        vTaskDelete(NULL);
        return;
    }
    ESP_LOGI(TAG, "host mode: waiting for a device");
    while (!s_client_quit) {
        usb_host_client_handle_events(s_client, pdMS_TO_TICKS(250));
        while (s_pending_new_n > 0) {
            uint8_t addr = s_pending_new[--s_pending_new_n];
            inspect(addr);
        }
        while (s_pending_gone_n > 0) {
            drop_gone(s_pending_gone[--s_pending_gone_n]);
        }
        if (s_msc_pending_gone) {
            s_msc_pending_gone = false;
            msc_unmount();
        }
        if (s_msc_pending_addr) {
            uint8_t a = s_msc_pending_addr;
            s_msc_pending_addr = 0;
            msc_mount(a);
        }
    }
    msc_unmount();
    close_all();
    usb_host_client_deregister(s_client);
    s_client = NULL;
    xSemaphoreGive(s_task_done);
    vTaskDelete(NULL);
}

/* usb_host_install() allocates the OTG interrupt on the core it is called
 * from. Called from the portal's httpd task it failed with ESP_ERR_NOT_FOUND
 * (measured 2026-09-12: "Interrupt alloc error", no free level-1 slot on that
 * core - WiFi, BT, the display's DMA and the rest live there), while TinyUSB
 * came up fine because it installs from its own task, pinned to core 1. So
 * the library task is pinned to core 1 and does the install itself, first
 * with level 1 and then with any low/medium level. */
static void host_lib_task(void *arg)
{
    usb_host_config_t cfg = {
        .skip_phy_setup = false,
        .intr_flags = ESP_INTR_FLAG_LEVEL1,
    };
    s_install_err = usb_host_install(&cfg);
    if (s_install_err == ESP_ERR_NOT_FOUND) {
        cfg.intr_flags = ESP_INTR_FLAG_LOWMED;
        s_install_err = usb_host_install(&cfg);
    }
    if (s_install_err != ESP_OK) {
        ESP_LOGE(TAG, "usb_host_install: %s (interrupts below, on the console)",
                 esp_err_to_name(s_install_err));
        esp_intr_dump(stdout);
        xSemaphoreGive(s_installed);
        vTaskDelete(NULL);
        return;
    }
    xSemaphoreGive(s_installed);

    bool clients = true, wait_free = false;
    while (clients) {
        uint32_t flags = 0;
        usb_host_lib_handle_events(portMAX_DELAY, &flags);
        if (flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
            if (usb_host_device_free_all() == ESP_OK) {
                clients = false;
            } else {
                wait_free = true;
            }
        }
        if (wait_free && (flags & USB_HOST_LIB_EVENT_FLAGS_ALL_FREE)) {
            clients = false;
        }
    }
    xSemaphoreGive(s_task_done);
    vTaskDelete(NULL);
}

static bool host_start(void)
{
    memset(s_devs, 0, sizeof(s_devs));
    s_seen = 0;
    s_client_quit = false;
    s_pending_new_n = 0;
    s_pending_gone_n = 0;
    /* Drain the semaphores, in case a previous stop timed out. */
    while (xSemaphoreTake(s_task_done, 0) == pdTRUE) { }
    while (xSemaphoreTake(s_installed, 0) == pdTRUE) { }

    if (xTaskCreatePinnedToCore(host_lib_task, "usb_lib", 4096, NULL, 5, NULL, 1) != pdPASS) {
        ESP_LOGE(TAG, "could not create the host library task");
        return false;
    }
    if (xSemaphoreTake(s_installed, pdMS_TO_TICKS(3000)) != pdTRUE || s_install_err != ESP_OK) {
        return false;      /* the task logged it and is gone */
    }
    if (xTaskCreatePinnedToCore(host_client_task, "usb_cli", 5120, NULL, 4, NULL, 1) != pdPASS) {
        ESP_LOGE(TAG, "could not create the host client task");
        /* The library task exits on NO_CLIENTS once nobody registers; wait
         * for it, then uninstall. */
        xSemaphoreTake(s_task_done, pdMS_TO_TICKS(2000));
        usb_host_uninstall();
        return false;
    }
    s_msc_pending_addr = 0;
    s_msc_pending_gone = false;
    const msc_host_driver_config_t msc_cfg = {
        .create_backround_task = true,
        .task_priority = 5,
        .stack_size = 4096,
        .core_id = 1,
        .callback = msc_event_cb,
    };
    esp_err_t e = msc_host_install(&msc_cfg);
    s_msc_installed = (e == ESP_OK);
    if (!s_msc_installed) {
        ESP_LOGW(TAG, "msc_host_install: %s (host mode without pendrives)", esp_err_to_name(e));
    }
    return true;
}

static void host_stop(void)
{
    s_client_quit = true;
    if (s_client) {
        usb_host_client_unblock(s_client);
    }
    /* The client task unmounts the pendrive and deregisters; then the MSC
     * driver's own client goes; NO_CLIENTS is what the library task waits
     * for. 2 s each; never hang the caller. */
    if (xSemaphoreTake(s_task_done, pdMS_TO_TICKS(2000)) != pdTRUE) {
        ESP_LOGW(TAG, "the client task did not finish in time");
    }
    if (s_msc_installed) {
        esp_err_t e = msc_host_uninstall();
        if (e != ESP_OK) {
            ESP_LOGW(TAG, "msc_host_uninstall: %s", esp_err_to_name(e));
        }
        s_msc_installed = false;
    }
    if (xSemaphoreTake(s_task_done, pdMS_TO_TICKS(2000)) != pdTRUE) {
        ESP_LOGW(TAG, "the library task did not finish in time");
    }
    esp_err_t e = usb_host_uninstall();
    if (e != ESP_OK) {
        ESP_LOGW(TAG, "usb_host_uninstall: %s", esp_err_to_name(e));
    }
}

