charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
/* -------------------------------------------------------------------------- */
/* Disk mode: the microSD as a USB drive                                       */
/* -------------------------------------------------------------------------- */

static void msc_storage_cb(tinyusb_msc_storage_handle_t h, tinyusb_msc_event_t *ev, void *arg)
{
    /* From the TinyUSB task. */
    switch (ev->id) {
    case TINYUSB_MSC_EVENT_MOUNT_COMPLETE: {
        bool on_watch = ev->mount_point == TINYUSB_MSC_STORAGE_MOUNT_APP;
        s_card_away = !on_watch;
        aos_hal_sd_mark_mounted(on_watch);
        ESP_LOGI(TAG, "%s", on_watch ? "card back on the watch (the computer ejected it)"
                                     : "card handed to the computer");
        break;
    }
    case TINYUSB_MSC_EVENT_MOUNT_FAILED:
        ESP_LOGW(TAG, "card mount/unmount failed (%s side)",
                 ev->mount_point == TINYUSB_MSC_STORAGE_MOUNT_APP ? "watch" : "USB");
        break;
    case TINYUSB_MSC_EVENT_FORMAT_REQUIRED:
        ESP_LOGE(TAG, "the card has no filesystem the watch can mount; it is NOT formatted here");
        break;
    default:
        break;
    }
}

/* The BSP's slot, pin for pin (bsp_sdcard_mount). */
static bool sd_take(void)
{
    if (!aos_hal_sd_release()) {
        ESP_LOGW(TAG, "no card to hand over");
        return false;
    }
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    const sdmmc_slot_config_t slot = {
        .clk = BSP_SD_CLK, .cmd = BSP_SD_CMD, .d0 = BSP_SD_D0,
        .d1 = GPIO_NUM_NC, .d2 = GPIO_NUM_NC, .d3 = GPIO_NUM_NC, .d4 = GPIO_NUM_NC,
        .d5 = GPIO_NUM_NC, .d6 = GPIO_NUM_NC, .d7 = GPIO_NUM_NC,
        .cd = SDMMC_SLOT_NO_CD, .wp = SDMMC_SLOT_NO_WP, .width = 1, .flags = 0,
    };
    esp_err_t e = sdmmc_host_init();
    if (e == ESP_OK) e = sdmmc_host_init_slot(host.slot, &slot);
    if (e == ESP_OK) {
        s_card = calloc(1, sizeof(sdmmc_card_t));
        e = s_card ? sdmmc_card_init(&host, s_card) : ESP_ERR_NO_MEM;
    }
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "card init for disk mode: %s", esp_err_to_name(e));
        free(s_card);
        s_card = NULL;
        sdmmc_host_deinit();
        aos_hal_sd_reclaim();
        return false;
    }
    ESP_LOGI(TAG, "card taken: %s, %llu MB", s_card->cid.name,
             (unsigned long long)((uint64_t)s_card->csd.capacity * s_card->csd.sector_size >> 20));
    return true;
}

static void sd_give_back(void)
{
    sdmmc_host_deinit();
    free(s_card);
    s_card = NULL;
    aos_hal_sd_reclaim();
}

static bool disk_start(void)
{
    if (!sd_take()) {
        return false;
    }
    const tinyusb_msc_driver_config_t dcfg = { .callback = msc_storage_cb };   /* auto-mount on */
    esp_err_t e = tinyusb_msc_install_driver(&dcfg);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "tinyusb_msc_install_driver: %s", esp_err_to_name(e));
        sd_give_back();
        return false;
    }
    const tinyusb_msc_storage_config_t scfg = {
        .medium.card = s_card,
        .fat_fs = {
            .base_path = BSP_SD_MOUNT_POINT,
            .config = { .format_if_mount_failed = false, .max_files = 8, .allocation_unit_size = 16 * 1024 },
            .do_not_format = true,
        },
        .mount_point = TINYUSB_MSC_STORAGE_MOUNT_USB,
    };
    e = tinyusb_msc_new_storage_sdmmc(&scfg, &s_storage);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "tinyusb_msc_new_storage_sdmmc: %s", esp_err_to_name(e));
        s_storage = NULL;
        tinyusb_msc_uninstall_driver();
        sd_give_back();
        return false;
    }
    s_card_away = true;
    s_device_with_msc = true;
    if (!device_start()) {
        s_device_with_msc = false;
        tinyusb_msc_delete_storage(s_storage);
        s_storage = NULL;
        tinyusb_msc_uninstall_driver();
        s_card_away = false;
        sd_give_back();
        return false;
    }
    ESP_LOGI(TAG, "disk mode: the card is the computer's until it ejects it");
    return true;
}

static void disk_stop(void)
{
    STEP(30);
    device_stop();
    s_device_with_msc = false;
    STEP(31);
    if (s_storage) {
        esp_err_t e = tinyusb_msc_delete_storage(s_storage);     /* unmounts /sdcard if it was back */
        if (e != ESP_OK) ESP_LOGW(TAG, "tinyusb_msc_delete_storage: %s", esp_err_to_name(e));
        s_storage = NULL;
    }
    STEP(32);
    tinyusb_msc_uninstall_driver();
    s_card_away = false;
    aos_hal_sd_mark_mounted(false);
    STEP(33);
    sd_give_back();
    STEP(34);
}

bool aos_usb_disk_card_away(void)
{
    return s_card_away;
}

/* -------------------------------------------------------------------------- */
/* The switch                                                                  */
/* -------------------------------------------------------------------------- */

aos_usb_mode_t aos_usb_mode_get(void)
{
    return s_mode;
}

const char *aos_usb_mode_name(aos_usb_mode_t mode)
{
    switch (mode) {
    case AOS_USB_CONSOLE: return "console";
    case AOS_USB_DEVICE:  return "device";
    case AOS_USB_HOST:    return "host";
    case AOS_USB_DISK:    return "disk";
    default:              return "?";
    }
}

void aos_usb_console_on_cdc(bool on)
{
    s_console_on_cdc = on;
}

bool aos_usb_mode_set(aos_usb_mode_t mode)
{
    if (!ensure_init()) {
        return false;
    }
    xSemaphoreTake(s_lock, portMAX_DELAY);
    if (mode == s_mode) {
        xSemaphoreGive(s_lock);
        return true;
    }
    mem_line("before the switch");

    /* Leave the current mode: teardown first, the PHY back afterwards.
     * Measured both ways (2026-09-12): with the mux flipped before the
     * uninstall the computer never sees a detach (the OTG side's pull-up
     * override is still in force through the pad toggle) and keeps the old
     * device's node until the cable is pulled; with the uninstall first the
     * overrides are gone, the pad toggle is a real detach, and the
     * Serial-JTAG is back on the computer 0.6 s later. The table lock is
     * released around the host teardown because its tasks take it to close
     * their devices. */
    STEP(10);
    if (s_mode == AOS_USB_DEVICE) {
        device_stop();
    } else if (s_mode == AOS_USB_DISK) {
        disk_stop();
    } else if (s_mode == AOS_USB_HOST) {
        xSemaphoreGive(s_lock);
        host_stop();
        xSemaphoreTake(s_lock, portMAX_DELAY);
    }
    STEP(11);
    if (s_mode != AOS_USB_CONSOLE) {
        phy_back_to_console();
        if (s_pm_lock) esp_pm_lock_release(s_pm_lock);
        s_mode = AOS_USB_CONSOLE;
        mem_line("back on the console");
    }

